# Pandas

**pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.**

https://pandas.pydata.org/

* Introduction


* Series


* Dataframes


* Missing data handling 


* GroupBy


* Operations


* Data input / output


* Merging, joining, and concatenating

#### Series

Similar to numpy array, diiferent types

Series in indexed by labels, and has axis labels

#### Import libraries

In [1]:
import numpy as np
import pandas as pd

#### Create series

In [2]:
labels = ['a','b','c']
myList = [1,2,3]
arr = np.array([10,20,30])
d = {'a':11,'b':12,'c':14}

#### Using list

In [3]:
pd.Series(myList)

0    1
1    2
2    3
dtype: int64

In [4]:
pd.Series(data=myList,index=labels)

a    1
b    2
c    3
dtype: int64

#### Using Dictionary

In [5]:
pd.Series(d)

a    11
b    12
c    14
dtype: int64

##### Operations

In [6]:
d1={"USA":12,"China":65,"India":56}
d2={"USA":12,"EU":65,"India":56}

In [7]:
ser1=pd.Series(d1)
ser2=pd.Series(d2)

In [8]:
ser1+ser2

China      NaN
EU         NaN
India    112.0
USA       24.0
dtype: float64

#### DataFrames

Main workhorse of pandas

Bunch of series objects with same index put together

In [9]:
df = pd.DataFrame(data=np.random.randn(5,4),
                  index=['A', 'B', 'C', 'D', 'E'],
                  columns='W X Y Z'.split())


#'A B C D E'.split())
#['A', 'B', 'C', 'D', 'E']

df

          W         X         Y         Z
A -0.569100 -0.084155 -0.846510 -1.397297
B  1.708675  0.664588 -0.169281  0.006246
C -0.686629 -1.482483 -0.945229 -2.318457
D  1.432320 -0.608744 -0.988636 -0.350024
E -0.505227  1.398927  0.395654  2.398598

In [10]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

#### Selection and Indexing

In [11]:
df['W']

A   -0.569100
B    1.708675
C   -0.686629
D    1.432320
E   -0.505227
Name: W, dtype: float64

In [12]:
df.W # sql syntax NOT RECOMMENDED

A   -0.569100
B    1.708675
C   -0.686629
D    1.432320
E   -0.505227
Name: W, dtype: float64

In [13]:
df[['W','Z']]

          W         Z
A -0.569100 -1.397297
B  1.708675  0.006246
C -0.686629 -2.318457
D  1.432320 -0.350024
E -0.505227  2.398598

In [14]:
df['new'] = df['W']+df['Z']

In [15]:
df

          W         X         Y         Z       new
A -0.569100 -0.084155 -0.846510 -1.397297 -1.966398
B  1.708675  0.664588 -0.169281  0.006246  1.714920
C -0.686629 -1.482483 -0.945229 -2.318457 -3.005085
D  1.432320 -0.608744 -0.988636 -0.350024  1.082296
E -0.505227  1.398927  0.395654  2.398598  1.893371

In [16]:
df['sum']=df['X']+df['W']
df

          W         X         Y         Z       new       sum
A -0.569100 -0.084155 -0.846510 -1.397297 -1.966398 -0.653255
B  1.708675  0.664588 -0.169281  0.006246  1.714920  2.373262
C -0.686629 -1.482483 -0.945229 -2.318457 -3.005085 -2.169111
D  1.432320 -0.608744 -0.988636 -0.350024  1.082296  0.823577
E -0.505227  1.398927  0.395654  2.398598  1.893371  0.893701

In [17]:
df['sum']

A   -0.653255
B    2.373262
C   -2.169111
D    0.823577
E    0.893701
Name: sum, dtype: float64

In [18]:
df.sum

<bound method DataFrame.sum of           W         X         Y         Z       new       sum
A -0.569100 -0.084155 -0.846510 -1.397297 -1.966398 -0.653255
B  1.708675  0.664588 -0.169281  0.006246  1.714920  2.373262
C -0.686629 -1.482483 -0.945229 -2.318457 -3.005085 -2.169111
D  1.432320 -0.608744 -0.988636 -0.350024  1.082296  0.823577
E -0.505227  1.398927  0.395654  2.398598  1.893371  0.893701>

In [19]:
df.drop('sum',axis=1)

          W         X         Y         Z       new
A -0.569100 -0.084155 -0.846510 -1.397297 -1.966398
B  1.708675  0.664588 -0.169281  0.006246  1.714920
C -0.686629 -1.482483 -0.945229 -2.318457 -3.005085
D  1.432320 -0.608744 -0.988636 -0.350024  1.082296
E -0.505227  1.398927  0.395654  2.398598  1.893371

In [20]:
df

          W         X         Y         Z       new       sum
A -0.569100 -0.084155 -0.846510 -1.397297 -1.966398 -0.653255
B  1.708675  0.664588 -0.169281  0.006246  1.714920  2.373262
C -0.686629 -1.482483 -0.945229 -2.318457 -3.005085 -2.169111
D  1.432320 -0.608744 -0.988636 -0.350024  1.082296  0.823577
E -0.505227  1.398927  0.395654  2.398598  1.893371  0.893701

In [21]:
df = df.drop('sum',axis=1)
df

          W         X         Y         Z       new
A -0.569100 -0.084155 -0.846510 -1.397297 -1.966398
B  1.708675  0.664588 -0.169281  0.006246  1.714920
C -0.686629 -1.482483 -0.945229 -2.318457 -3.005085
D  1.432320 -0.608744 -0.988636 -0.350024  1.082296
E -0.505227  1.398927  0.395654  2.398598  1.893371

In [22]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A -0.569100 -0.084155 -0.846510 -1.397297
B  1.708675  0.664588 -0.169281  0.006246
C -0.686629 -1.482483 -0.945229 -2.318457
D  1.432320 -0.608744 -0.988636 -0.350024
E -0.505227  1.398927  0.395654  2.398598

In [23]:
df.drop('E')

          W         X         Y         Z
A -0.569100 -0.084155 -0.846510 -1.397297
B  1.708675  0.664588 -0.169281  0.006246
C -0.686629 -1.482483 -0.945229 -2.318457
D  1.432320 -0.608744 -0.988636 -0.350024

#### Selection

In [24]:
df

          W         X         Y         Z
A -0.569100 -0.084155 -0.846510 -1.397297
B  1.708675  0.664588 -0.169281  0.006246
C -0.686629 -1.482483 -0.945229 -2.318457
D  1.432320 -0.608744 -0.988636 -0.350024
E -0.505227  1.398927  0.395654  2.398598

In [25]:
df.loc['A'] # Selection by label index

W   -0.569100
X   -0.084155
Y   -0.846510
Z   -1.397297
Name: A, dtype: float64

In [26]:
df.iloc[0] # Selection by numeric index

W   -0.569100
X   -0.084155
Y   -0.846510
Z   -1.397297
Name: A, dtype: float64

###### Selecting subsets

In [27]:
df.loc['B','Y']=0
df

          W         X         Y         Z
A -0.569100 -0.084155 -0.846510 -1.397297
B  1.708675  0.664588  0.000000  0.006246
C -0.686629 -1.482483 -0.945229 -2.318457
D  1.432320 -0.608744 -0.988636 -0.350024
E -0.505227  1.398927  0.395654  2.398598

In [28]:
df.loc[['A','B'],['W','Y']]

          W        Y
A -0.569100 -0.84651
B  1.708675  0.00000

##### Conditional Selection

In [29]:
df

          W         X         Y         Z
A -0.569100 -0.084155 -0.846510 -1.397297
B  1.708675  0.664588  0.000000  0.006246
C -0.686629 -1.482483 -0.945229 -2.318457
D  1.432320 -0.608744 -0.988636 -0.350024
E -0.505227  1.398927  0.395654  2.398598

In [30]:
df[df['W']>0]

          W         X         Y         Z
B  1.708675  0.664588  0.000000  0.006246
D  1.432320 -0.608744 -0.988636 -0.350024

In [31]:
df['W']>0

A    False
B     True
C    False
D     True
E    False
Name: W, dtype: bool

In [32]:
df[df['W']>0]['Z']

B    0.006246
D   -0.350024
Name: Z, dtype: float64

##### index

In [33]:
df

          W         X         Y         Z
A -0.569100 -0.084155 -0.846510 -1.397297
B  1.708675  0.664588  0.000000  0.006246
C -0.686629 -1.482483 -0.945229 -2.318457
D  1.432320 -0.608744 -0.988636 -0.350024
E -0.505227  1.398927  0.395654  2.398598

In [34]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.569100 -0.084155 -0.846510 -1.397297
1     B  1.708675  0.664588  0.000000  0.006246
2     C -0.686629 -1.482483 -0.945229 -2.318457
3     D  1.432320 -0.608744 -0.988636 -0.350024
4     E -0.505227  1.398927  0.395654  2.398598

In [35]:
df

          W         X         Y         Z
A -0.569100 -0.084155 -0.846510 -1.397297
B  1.708675  0.664588  0.000000  0.006246
C -0.686629 -1.482483 -0.945229 -2.318457
D  1.432320 -0.608744 -0.988636 -0.350024
E -0.505227  1.398927  0.395654  2.398598

In [36]:
#df.reset_index(inplace=True)

In [37]:
df

          W         X         Y         Z
A -0.569100 -0.084155 -0.846510 -1.397297
B  1.708675  0.664588  0.000000  0.006246
C -0.686629 -1.482483 -0.945229 -2.318457
D  1.432320 -0.608744 -0.988636 -0.350024
E -0.505227  1.398927  0.395654  2.398598

In [38]:
newidx = 'US UK JP GE IN'.split()
newidx

['US', 'UK', 'JP', 'GE', 'IN']

In [39]:
df['idx']=newidx
df.set_index('idx')

            W         X         Y         Z
idx
US  -0.569100 -0.084155 -0.846510 -1.397297
UK   1.708675  0.664588  0.000000  0.006246
JP  -0.686629 -1.482483 -0.945229 -2.318457
GE   1.432320 -0.608744 -0.988636 -0.350024
IN  -0.505227  1.398927  0.395654  2.398598

**Multi index and hierarchy**

In [42]:
continents = 'AM AM AS AS EU EU'.split()
countries = 'US AR IN CN UK GE'.split()
print(f'continents : {continents}\ncountries : {countries}')

continents : ['AM', 'AM', 'AS', 'AS', 'EU', 'EU']
countries : ['US', 'AR', 'IN', 'CN', 'UK', 'GE']

In [43]:
hierIDX = list(zip(continents,countries))
hierIDX

[('AM', 'US'),
 ('AM', 'AR'),
 ('AS', 'IN'),
 ('AS', 'CN'),
 ('EU', 'UK'),
 ('EU', 'GE')]

In [44]:
hierIDX = pd.MultiIndex.from_tuples(hierIDX)
hierIDX

MultiIndex([('AM', 'US'),
            ('AM', 'AR'),
            ('AS', 'IN'),
            ('AS', 'CN'),
            ('EU', 'UK'),
            ('EU', 'GE')],
           )

In [45]:
df = pd.DataFrame(data=[100,200,300,400,500,600]
                  ,index=hierIDX
                  ,columns=['Population'])

In [46]:
df

       Population
AM US         100
   AR         200
AS IN         300
   CN         400
EU UK         500
   GE         600

In [47]:
df.loc['EU']

    Population
UK         500
GE         600

In [48]:
df.loc['EU'].loc['UK']

Population    500
Name: UK, dtype: int64

#### Missing Data Handling

In [51]:
df = pd.DataFrame({'A':[1,2,3],
                   'B':[5,np.nan,4],
                   'C':[6,7,np.nan],
                   'D':[np.nan,np.nan,9]})
df

   A    B    C    D
0  1  5.0  6.0  NaN
1  2  NaN  7.0  NaN
2  3  4.0  NaN  9.0

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       2 non-null      float64
 2   C       2 non-null      float64
 3   D       1 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 224.0 bytes

###### Strategy

* Fill missing values - Imputation
* Drop missing values

In [54]:
df.dropna(axis=1)

   A
0  1
1  2
2  3

In [55]:
df

   A    B    C    D
0  1  5.0  6.0  NaN
1  2  NaN  7.0  NaN
2  3  4.0  NaN  9.0

In [57]:
df.dropna(thresh=1)

   A    B    C    D
0  1  5.0  6.0  NaN
1  2  NaN  7.0  NaN
2  3  4.0  NaN  9.0

##### Imputation

In [58]:
df.fillna('value to fill')

   A              B              C              D
0  1              5              6  value to fill
1  2  value to fill              7  value to fill
2  3              4  value to fill              9

In [59]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    4.5
2    4.0
Name: B, dtype: float64

##### groupby

In [66]:
cmp = 'GOOG GOOG GOOG AAPL AAPL AAPL MSFT MSFT'.split()
sp = 'KIRAN VANDANA NAGA VIPUL OSCAR PUSPA SAIMA YESH'.split()
sales = [1000,2100,92121,1281,312818,1292,1821,281921]

In [67]:
df = pd.DataFrame(sales)

In [68]:
df["Company"] = cmp
df["Salesperson"] = sp

In [69]:
df

        0 Company Salesperson
0    1000    GOOG       KIRAN
1    2100    GOOG     VANDANA
2   92121    GOOG        NAGA
3    1281    AAPL       VIPUL
4  312818    AAPL       OSCAR
5    1292    AAPL       PUSPA
6    1821    MSFT       SAIMA
7  281921    MSFT        YESH

In [70]:
df.groupby('Company')

In [71]:
df.groupby('Company').sum()

              0
Company
AAPL     315391
GOOG      95221
MSFT     283742

In [72]:
df.groupby('Company').describe()

            0                                                           \
        count           mean            std     min      25%       50%
Company
AAPL      3.0  105130.333333  179862.795470  1281.0   1286.5    1292.0
GOOG      3.0   31740.333333   52294.083607  1000.0   1550.0    2100.0
MSFT      2.0  141871.000000  198060.609410  1821.0  71846.0  141871.0


              75%       max
Company
AAPL     157055.0  312818.0
GOOG      47110.5   92121.0
MSFT     211896.0  281921.0

In [73]:
df.groupby('Company').describe().transpose()

Company           AAPL          GOOG          MSFT
0 count       3.000000      3.000000       2.00000
  mean   105130.333333  31740.333333  141871.00000
  std    179862.795470  52294.083607  198060.60941
  min      1281.000000   1000.000000    1821.00000
  25%      1286.500000   1550.000000   71846.00000
  50%      1292.000000   2100.000000  141871.00000
  75%    157055.000000  47110.500000  211896.00000
  max    312818.000000  92121.000000  281921.00000

##### Pivot Tables

In [74]:
url = "https://raw.githubusercontent.com/resbaz/r-novice-gapminder-files/master/data/gapminder-FiveYearData.csv"

df = pd.read_csv(url)

df.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [75]:
df.shape

(1704, 6)

In [76]:
df.describe()

             year           pop      lifeExp      gdpPercap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165877
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846989
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   year       1704 non-null   int64
 2   pop        1704 non-null   float64
 3   continent  1704 non-null   object
 4   lifeExp    1704 non-null   float64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 80.0+ KB

In [78]:
df1 = df[['continent','lifeExp']]

df1.head(20)

   continent  lifeExp
0       Asia   28.801
1       Asia   30.332
2       Asia   31.997
3       Asia   34.020
4       Asia   36.088
5       Asia   38.438
6       Asia   39.854
7       Asia   40.822
8       Asia   41.674
9       Asia   41.763
10      Asia   42.129
11      Asia   43.828
12    Europe   55.230
13    Europe   59.280
14    Europe   64.820
15    Europe   66.220
16    Europe   67.690
17    Europe   68.930
18    Europe   70.420
19    Europe   72.000

In [80]:
pd.pivot_table(df1,values='lifeExp',columns='continent',aggfunc='mean')

continent    Africa   Americas       Asia     Europe    Oceania
lifeExp    48.86533  64.658737  60.064903  71.903686  74.326208

In [82]:
df1['continent'].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [83]:
df1['continent'].nunique()

5

In [84]:
df['continent'].value_counts()

Africa      624
Asia        396
Europe      360
Americas    300
Oceania      24
Name: continent, dtype: int64

In [88]:
df.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [89]:
df.tail()

       country  year         pop continent  lifeExp   gdpPercap
1699  Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700  Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701  Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702  Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703  Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

# Great Job!